app/Models/AssignmentModel.php

SELECT *
FROM `assignments`
JOIN `officer` ON `assignempno`=`empno`
JOIN `items` ON `assignitemno`=`itemno`
WHERE `assignments`.`deleted_at` IS NULL
AND `officer`.`deleted_at` IS NULL
AND `items`.`deleted_at` IS NULL
ORDER BY `assignments`.`assignempno` ASC
---
    public function getAllAssignments(){
		$db = db_connect();
		$builder = $db->table('assignments');
		$builder->select('*');
        $builder->join("officer","assignempno=empno");
        $builder->join("items","assignitemno=itemno");
        $builder->where('assignments.deleted_at',null);
        $builder->where('officer.deleted_at',null);
        $builder->where('items.deleted_at',null);
        $builder->orderBy("assignments.assignempno","ASC");
		$records = $builder->get();