app/Models/ItemModel.php

SELECT *
FROM `items`
WHERE `deleted_at` IS NULL
---
	public function getAllItems(){
		$db = db_connect();
		$builder = $db->table('items');
		$builder->select('*');
        $builder->where('deleted_at',null);
		$records = $builder->get();

SELECT *
FROM `items`
WHERE `deleted_at` IS NULL
---
    public function getAllAvailableItems(){
		$db = db_connect();
		$builder = $db->table('items');
		$builder->select('*');
        $builder->where('deleted_at',null);
		$records = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `assignments`
WHERE `assignitemno` = '1'
AND `deleted_at` IS NULL
---
    public function getAvailability($itemno){
		$db = db_connect();
		$builder = $db->table('assignments');
		$builder->select('*');
        $builder->where('assignitemno',$itemno);
        $builder->where('deleted_at',null);
		$records = $builder->countAllResults();