app/Models/OfficerModel.php

	public function getAllOfficers(){
		$db = db_connect();
		$builder = $db->table('officer');
		$builder->select('*');
        $builder->where('deleted_at',null);
		$records = $builder->get();
---
SELECT *
FROM `officer`
WHERE `deleted_at` IS NULL