app/Models/ReportModel.php

SELECT *
FROM `items`
WHERE `items`.`deleted_at` IS NULL
---
	public function inventory(){
        $db = db_connect();
		$builder = $db->table('items');
		$builder->select('*');
		$builder->where('items.deleted_at',null);
		$records = $builder->get();

SELECT `empName`, `workingLocation`, `assignments`.`updated_at`
FROM `assignments`
JOIN `officer` ON `assignempno`=`empno`
WHERE `assignments`.`assignitemno` = '1'
AND `assignments`.`deleted_at` IS NULL
AND `officer`.`deleted_at` IS NULL
---
    public function inventory_status_peritem($itemno){
        $db = db_connect();
		$builder = $db->table('assignments');
		$builder->select('empName,workingLocation,assignments.updated_at');
        $builder->join('officer','assignempno=empno');
        $builder->where('assignments.assignitemno',$itemno);
		$builder->where('assignments.deleted_at',null);
        $builder->where('officer.deleted_at',null);
		$records = $builder->get();